Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionWrongType
Structural Custom Connection has an inappropriate type assigned.

Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionEmpty
Structural Custom Connection cannot be empty.

Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionComponentsRelationship
Cannot create custom connection due to relationships to external elements.

Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCannotCreateCustomConnection
Could not create a custom connection.

Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.SimpleConnectionTooFarRefs
Simple Structural Connection Handler cannot connect too far elements

Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures
Failures about StructuralConnectionHandler.